# CantileverHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionConcreteCross..::..CantileverHeight Property
StructuralSectionConcreteCross Class See Also
---
Flange cantilever thickness.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double CantileverHeight { get; set; }
```

Visual Basic
---
```text
Public Property CantileverHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CantileverHeight {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionConcreteCross Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace